{
  "model_type": "distilbert",
  "architectures": ["DistilBertForSequenceClassification"],
  "attention_probs_dropout_prob": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_act": "gelu",
  "hidden_dim": 3072,
  "id2label": {
    "0": "abusive_friendly",
    "1": "abusive_hostile",
    "2": "non_abusive_positive",
    "3": "non_abusive_negative"
  },
  "initializer_range": 0.02,
  "label2id": {
    "abusive_friendly": 0,
    "abusive_hostile": 1,
    "non_abusive_positive": 2,
    "non_abusive_negative": 3
  },
  "max_position_embeddings": 512,
  "n_heads": 12,
  "n_layers": 6,
  "num_labels": 4,
  "output_attentions": false,
  "output_hidden_states": false,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_word_embeddings": true,
  "transformers_version": "4.35.2",
  "vocab_size": 30522
}
